W7D3/GoalsApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$pE.A2zfca3e.uV1EJvQrOuTTytAo64rnDpBEuwcHu7yKW6eyPP3sK"], ["updated_at", "2022-02-10 00:26:02.885264"], ["id", 142]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)