W6D3/first_routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        #User.find(params[:id])
            render json: Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited_by_owner" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorited_by_owner", true], ["updated_at", "2022-02-03 23:30:59.333759"], ["id", 2]]
---
    def favorite
        artwork = Artwork.find(params[:id])
        if artwork
            artwork.favorited_by_owner = true
            artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "updated_at" = $1, "favorited_by_owner" = $2 WHERE "artworks"."id" = $3  [["updated_at", "2022-02-04 00:46:07.098163"], ["favorited_by_owner", false], ["id", 3]]
---
    def unfavorite
        # debugger
        artwork = Artwork.find(params[:id])
        if artwork
            artwork.favorited_by_owner = false
            artwork.save