W6D3/first_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
        if params['comments'][:user_id]
            user = User.find(params['comments'][:user_id]).comments
        elsif params['comments'][:artwork_id]
            comments = Artwork.find(params['comments'][:artwork_id]).comments
        else
            comments = Comment.all