W6D3/first_routes/app/controllers/users_controller.rb

    def index
        # if params[:query]
        #     user = User.where('username LIKE ?', 'params[:query]')
        #     render json: user
        # else
        #     render json: User.all #User.all
        # end
        if params.has_key?('username')
            #render json: User.where(users: {username: '77777777'})
            render json: User.where('username LIKE ?', params['username'])
        else
            # render json: ['weyufgwegyhudujed', User.all]
            render json: ['eydgdfgywe', params, User.all]
---
SELECT "users".* FROM "users" WHERE (users.username LIKE '77777777')
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "hdfwebhjidrew"], ["email", "JohnSmith4@gmail.com"], ["created_at", "2022-02-02 23:15:42.312322"], ["updated_at", "2022-02-02 23:15:42.312322"]]

    def show
        #User.find(params[:id])
            render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        if User.find(params[:id])
            User.delete(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]

    def update
        user = User.find(params[:id])
        if user
            user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "username" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "JohnDoe@gmail.com"], ["username", "77777777"], ["updated_at", "2022-02-02 23:35:53.572232"], ["id", 1]]